{"format": "graph-model", "generatedBy": "2.6.2", "convertedBy": "TensorFlow.js Converter v3.17.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}, "output_2": {"name": "Identity_1:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1561535"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "271358"}, {"size": "24"}]}}}}}, {"name": "StatefulPartitionedCall/brute_force/model/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brute_force/model/average_pooling1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brute_force/model/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/brute_force/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1561535"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brute_force/TopKV2/k", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brute_force/Gather/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/brute_force/model/Cast", "op": "Cast", "input": ["input_1"], "attr": {"SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brute_force/model/embedding/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/brute_force/model/Cast"], "attr": {"DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brute_force/model/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/brute_force/model/embedding/Cast", "StatefulPartitionedCall/brute_force/model/embedding/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brute_force/model/average_pooling1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/brute_force/model/embedding/embedding_lookup", "StatefulPartitionedCall/brute_force/model/average_pooling1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brute_force/model/average_pooling1d/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/brute_force/model/average_pooling1d/ExpandDims"], "attr": {"padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "3", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "3", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/brute_force/model/average_pooling1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/brute_force/model/average_pooling1d/AvgPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "StatefulPartitionedCall/brute_force/model/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/brute_force/model/average_pooling1d/Squeeze", "StatefulPartitionedCall/brute_force/model/flatten/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brute_force/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/brute_force/model/flatten/Reshape", "StatefulPartitionedCall/brute_force/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": true}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/brute_force/TopKV2", "op": "TopKV2", "input": ["StatefulPartitionedCall/brute_force/MatMul", "StatefulPartitionedCall/brute_force/TopKV2/k"], "attr": {"T": {"type": "DT_FLOAT"}, "sorted": {"b": true}}}, {"name": "StatefulPartitionedCall/brute_force/Gather", "op": "GatherV2", "input": ["unknown_1", "StatefulPartitionedCall/brute_force/TopKV2:1", "StatefulPartitionedCall/brute_force/Gather/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT64"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/brute_force/Gather"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/brute_force/TopKV2", "^StatefulPartitionedCall/brute_force/Gather"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of44.bin", "group1-shard2of44.bin", "group1-shard3of44.bin", "group1-shard4of44.bin", "group1-shard5of44.bin", "group1-shard6of44.bin", "group1-shard7of44.bin", "group1-shard8of44.bin", "group1-shard9of44.bin", "group1-shard10of44.bin", "group1-shard11of44.bin", "group1-shard12of44.bin", "group1-shard13of44.bin", "group1-shard14of44.bin", "group1-shard15of44.bin", "group1-shard16of44.bin", "group1-shard17of44.bin", "group1-shard18of44.bin", "group1-shard19of44.bin", "group1-shard20of44.bin", "group1-shard21of44.bin", "group1-shard22of44.bin", "group1-shard23of44.bin", "group1-shard24of44.bin", "group1-shard25of44.bin", "group1-shard26of44.bin", "group1-shard27of44.bin", "group1-shard28of44.bin", "group1-shard29of44.bin", "group1-shard30of44.bin", "group1-shard31of44.bin", "group1-shard32of44.bin", "group1-shard33of44.bin", "group1-shard34of44.bin", "group1-shard35of44.bin", "group1-shard36of44.bin", "group1-shard37of44.bin", "group1-shard38of44.bin", "group1-shard39of44.bin", "group1-shard40of44.bin", "group1-shard41of44.bin", "group1-shard42of44.bin", "group1-shard43of44.bin", "group1-shard44of44.bin"], "weights": [{"name": "unknown_1", "shape": [1561535], "dtype": "int32"}, {"name": "unknown", "shape": [271358, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brute_force/model/embedding/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brute_force/model/average_pooling1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brute_force/model/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brute_force/MatMul/ReadVariableOp", "shape": [1561535, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brute_force/TopKV2/k", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brute_force/Gather/axis", "shape": [], "dtype": "int32"}]}]}